interfaces/src/main/resources/templates/GeefHistoriekPersoon/02.02.0000/template.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header/>
    <soapenv:Body>
        <p:GeefHistoriekPersoon xmlns:p="http://magda.vlaanderen.be/persoon/soap/geefhistoriekpersoon/v02_02" xmlns:p1="http://generiek-02_00.vip.vlaanderen.be" xmlns:p2="http://magda.vlaanderen.be/persoon-v3" xmlns:p3="http://magda.vlaanderen.be/generiek-v3" xmlns:p4="http://magda.vlaanderen.be/generiek/oslo-v3" xmlns:p5="http://sleutel-02_00.vip.vlaanderen.be" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://magda.vlaanderen.be/persoon/soap/geefhistoriekpersoon/v02_02 ../../../wsdl/magda/Persoon.GeefHistoriekPersoonDienst-02.02/WebService/GeefHistoriekPersoon.xsd ">
            <Verzoek xmlns="">
                <Context>
                    <Naam>GeefHistoriekPersoon</Naam>
                    <Versie>02.02.0000</Versie>
                    <Bericht>
                        <Type>VRAAG</Type>
                        <Tijdstip>
                            <Datum>2025-01-01</Datum>
                            <Tijd>12:00</Tijd>
                        </Tijdstip>
                        <Afzender>
                            <Identificatie>akb.vlaanderen.be/aiv/burgerloket-wwoom-mock</Identificatie>
                            <Referte>833dd928-ffc2-42fe-83d7-12e71d191f8d</Referte>
                            <Hoedanigheid>a1300</Hoedanigheid>
                        </Afzender>
                    </Bericht>
                </Context>
                <Vragen>
                    <Vraag>
                        <Referte>2178</Referte>
                        <Inhoud>
                            <Criteria>
                                <INSZ>90010100123</INSZ>
                                <Datum Op="0">1900-01-01</Datum>
                            </Criteria>
                            <Bron>SOA</Bron>
                            <Taal>nl</Taal>
                        </Inhoud>
                    </Vraag>

                </Vragen>
            </Verzoek>
        </p:GeefHistoriekPersoon>
    </soapenv:Body>
</soapenv:Envelope>
